Ran Plan for dir: `service_deployment/core-payment` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.deployment.aws_iam_role.codepipeline_role has been changed
~ resource "aws_iam_role" "codepipeline_role" {
        id                    = "avn-dev-core-payment-codepipeline-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AdministratorAccess",
        ]
        name                  = "avn-dev-core-payment-codepipeline-role"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.deployment.aws_secretsmanager_secret_version.secret_version has been changed
~ resource "aws_secretsmanager_secret_version" "secret_version" {
        id             = "arn:aws:secretsmanager:ap-southeast-2:714071859213:secret:avn-dev-core-payment-Txu3EA|22417C15-F124-4FC8-B946-76F072BEC89F"
      ~ version_stages = [
          + "AWSCURRENT",
        ]
        # (5 unchanged attributes hidden)
    }
  # module.deployment.aws_iam_role.codebuild_role has been changed
~ resource "aws_iam_role" "codebuild_role" {
        id                    = "avn-dev-core-payment-codebuild-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AdministratorAccess",
        ]
        name                  = "avn-dev-core-payment-codebuild-role"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.deployment.aws_ecr_repository.ecr_nginx has been changed
~ resource "aws_ecr_repository" "ecr_nginx" {
        id                   = "avn-dev-core-payment-nginx"
        name                 = "avn-dev-core-payment-nginx"
      + tags                 = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.deployment.aws_iam_role.task_execution_role has been changed
~ resource "aws_iam_role" "task_execution_role" {
        id                    = "avn-dev-core-payment-task-execution-role"
        name                  = "avn-dev-core-payment-task-execution-role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "avn-dev-core-payment-task-exeuction-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchCheckLayerAvailability",
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:BatchGetImage",
                              + "logs:CreateLogStream",
                              + "logs:PutLogEvents",
                              + "ssm:Describe*",
                              + "ssm:Get*",
                              + "ssm:List*",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.deployment.aws_secretsmanager_secret.secret has been changed
~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:ap-southeast-2:714071859213:secret:avn-dev-core-payment-Txu3EA"
        name                           = "avn-dev-core-payment"
      + tags                           = {}
        # (6 unchanged attributes hidden)
    }
  # module.deployment.aws_ssm_parameter.role_arn has been changed
~ resource "aws_ssm_parameter" "role_arn" {
        id        = "/avn/dev/secret/core/payment/IAM_ROLE_ARN"
        name      = "/avn/dev/secret/core/payment/IAM_ROLE_ARN"
      + tags      = {}
        # (8 unchanged attributes hidden)
    }
  # module.deployment.aws_security_group.sg has been changed
~ resource "aws_security_group" "sg" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow egress all protocol avn-dev-core-payment service"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-068af88cce7266b94"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow ingress http for avn-dev-core-payment service"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "avn-dev-core-payment-sg"
        tags                   = {
            "Code"    = "core"
            "Env"     = "dev"
            "Feature" = "payment"
            "Name"    = "avn-dev-core-payment-sg"
        }
        # (6 unchanged attributes hidden)
    }
  # module.deployment.aws_ecs_task_definition.task_definition has been changed
~ resource "aws_ecs_task_definition" "task_definition" {
        id                       = "avn-dev-core-payment"
      + tags                     = {}
        # (11 unchanged attributes hidden)
    }
  # module.deployment.aws_codepipeline.codepipeline has been changed
~ resource "aws_codepipeline" "codepipeline" {
        id       = "avn-dev-core-payment"
        name     = "avn-dev-core-payment"
      + tags     = {}
        # (3 unchanged attributes hidden)


      ~ stage {
            name = "Source"

          ~ action {
              + input_artifacts  = []
                name             = "Source"
                # (10 unchanged attributes hidden)
            }
        }
      ~ stage {
            name = "Deploy"

          ~ action {
                name             = "Deploy"
              + output_artifacts = []
                # (7 unchanged attributes hidden)
            }
        }
        # (2 unchanged blocks hidden)
    }
  # module.deployment.aws_ecr_repository.ecr_php has been changed
~ resource "aws_ecr_repository" "ecr_php" {
        id                   = "avn-dev-core-payment-php"
        name                 = "avn-dev-core-payment-php"
      + tags                 = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.deployment.aws_security_group_rule.sg_eg_all has been changed
~ resource "aws_security_group_rule" "sg_eg_all" {
        id                = "sgrule-4221198198"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (8 unchanged attributes hidden)
    }
  # module.deployment.aws_iam_role.task_role has been changed
~ resource "aws_iam_role" "task_role" {
        id                    = "avn-dev-core-payment-task-role"
        name                  = "avn-dev-core-payment-task-role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = "avn-dev-core-payment-policy-name"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:GetObjectAcl",
                              + "s3:GetObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "*",
                            ]
                          + Sid      = "Stmt1630978762833"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # module.deployment.aws_security_group_rule.sg_in_tcp has been changed
~ resource "aws_security_group_rule" "sg_in_tcp" {
        id                = "sgrule-3346534683"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (8 unchanged attributes hidden)
    }
  # module.deployment.aws_codepipeline_webhook.codepipeline_webhook has been changed
~ resource "aws_codepipeline_webhook" "codepipeline_webhook" {
        id              = "arn:aws:codepipeline:ap-southeast-2:714071859213:webhook:webhook-codepipeline-avn-dev-core-payment"
        name            = "webhook-codepipeline-avn-dev-core-payment"
      + tags            = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.deployment.aws_codebuild_project.build_project has been changed
~ resource "aws_codebuild_project" "build_project" {
        id                     = "arn:aws:codebuild:ap-southeast-2:714071859213:project/avn-dev-core-payment"
        name                   = "avn-dev-core-payment"
      + tags                   = {}
        # (8 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }
  # module.deployment.aws_cloudwatch_log_group.log_group has been changed
~ resource "aws_cloudwatch_log_group" "log_group" {
        id                = "/service/core/payment"
        name              = "/service/core/payment"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.deployment.aws_appautoscaling_policy.autoscaling_policy[0] will be created
+ resource "aws_appautoscaling_policy" "autoscaling_policy" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "avn-dev-core-payment-autoscaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/avn-dev-compute-ecs-cluster/avn-dev-core-payment"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 15
          + scale_out_cooldown = 5
          + target_value       = 175

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.deployment.aws_appautoscaling_target.autscaling_target will be created
+ resource "aws_appautoscaling_target" "autscaling_target" {
      + id                 = (known after apply)
      + max_capacity       = 8
      + min_capacity       = 2
      + resource_id        = "service/avn-dev-compute-ecs-cluster/avn-dev-core-payment"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.deployment.aws_ecs_service.ecs_service will be created
+ resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-southeast-2:714071859213:cluster/avn-dev-compute-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "avn-dev-core-payment"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "avn-dev-core-payment-php"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-068af88cce7266b94",
            ]
          + subnets          = [
              + "subnet-00f89800fa4237202",
              + "subnet-0511c6d48f039c9ae",
            ]
        }
    }

  # module.deployment.aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-2:714071859213:task-definition/avn-dev-core-payment:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment       = [] -> null
                  ~ portMappings      = [
                      ~ {
                          ~ containerPort = 80 -> 8000
                          ~ hostPort      = 80 -> 8000
                            # (1 unchanged element hidden)
                        },
                    ]
                    # (9 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "avn-dev-core-payment" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.deployment.aws_lb_listener.nlb_http_listener will be created
+ resource "aws_lb_listener" "nlb_http_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:loadbalancer/net/avn-dev-compute-ecs-nlb/e71b6466f0f517b8"
      + port              = 8000
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.deployment.aws_lb_target_group.nlb_tg must be replaced
-/+ resource "aws_lb_target_group" "nlb_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-payment-tg/e1d5552bc0feb549" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/avn-dev-core-payment-tg/e1d5552bc0feb549" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-payment-tg/e1d5552bc0feb549" -> (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
        name                               = "avn-dev-core-payment-tg"
      ~ port                               = 80 -> 8000 # forces replacement
      ~ preserve_client_ip                 = "false" -> (known after apply)
      + protocol_version                   = (known after apply)
        tags                               = {
            "Code"    = "core"
            "Env"     = "dev"
            "Feature" = "payment-tg"
            "Name"    = "avn-dev-core-payment-tg"
        }
        # (8 unchanged attributes hidden)

      ~ health_check {
          + matcher             = (known after apply)
          + path                = (known after apply)
          ~ timeout             = 10 -> (known after apply)
            # (6 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 0 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "source_ip" -> (known after apply)
        }
    }

  # module.deployment.aws_security_group_rule.sg_in_tcp must be replaced
-/+ resource "aws_security_group_rule" "sg_in_tcp" {
      ~ from_port                = 80 -> 8000 # forces replacement
      ~ id                       = "sgrule-3346534683" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      + source_security_group_id = (known after apply)
      ~ to_port                  = 80 -> 8000 # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 3 to destroy.

Warning: The CodePipeline GitHub version 1 action provider is deprecated.

  with module.deployment.aws_codepipeline.codepipeline,
  on ../../modules/deployment/codepipeline.tf line 39, in resource "aws_codepipeline" "codepipeline":
  39:       provider         = "GitHub"

Use a GitHub version 2 action (with a CodeStar Connection
`aws_codestarconnections_connection`) instead. See
https://docs.aws.amazon.com/codepipeline/latest/userguide/update-github-action-connections.html

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d service_deployment/core-payment`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.blast.co.id/lock?id=greyhats13%252Favana-aws-infra%252Fservice_deployment%252Fcore-payment%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d service_deployment/core-payment`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 7 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
